In [1]:
import pandas as pd

In [2]:
data={'name':['John','Arun','Divya'],
      'Math':[89,78,68],
      'science':[67,89,77]
}

In [3]:
data=pd.DataFrame(data)
data

    name  Math  science
0   John    89       67
1   Arun    78       89
2  Divya    68       77

In [5]:
data=pd.melt(data,id_vars='name',var_name='Subjects',value_name='Score')
data

    name Subjects  Score
0   John     Math     89
1   Arun     Math     78
2  Divya     Math     68
3   John  science     67
4   Arun  science     89
5  Divya  science     77

In [6]:
data={'City':['Chennai','Delhi','Bangalore'],
      'Day1' : [76,65,43],
      'Day2' :  [87,53,45],
      'Day3' : [45,55,32]
}

In [7]:
df=pd.DataFrame(data)

In [8]:
df

        City  Day1  Day2  Day3
0    Chennai    76    87    45
1      Delhi    65    53    55
2  Bangalore    43    45    32

In [9]:
df_melt=pd.melt(df,id_vars='City',var_name='Days',value_name='Temperature')
df_melt.head(4)

        City  Days  Temperature
0    Chennai  Day1           76
1      Delhi  Day1           65
2  Bangalore  Day1           43
3    Chennai  Day2           87

In [10]:
df_pivot=pd.pivot(df_melt,index='City',columns='Days',values='Temperature')
df_pivot

Days       Day1  Day2  Day3
City
Bangalore    43    45    32
Chennai      76    87    45
Delhi        65    53    55

In [22]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Fay', 'George'],
    'gender': ['F', 'M', 'M', 'M', 'F', 'F', 'M'],
    'age': [25, 30, 35, 40, 22, 28, 34]
}

In [23]:
df = pd.DataFrame(data)

In [33]:
gender=df['gender'].value_counts(normalize=True)*100

In [34]:
df['gender_percent']=df['gender'].map(gender)

In [28]:
age_bins = [0, 18, 25, 35, 45, 60, 100]
age_labels = ['0-18', '19-25', '26-35', '36-45', '46-60', '61-100']

df['age_groups']=pd.cut(df['age'],bins=age_bins,labels=age_labels)

In [37]:
df

      name gender  age age_groups  gender_percent
0    Alice      F   25      19-25       42.857143
1      Bob      M   30      26-35       57.142857
2  Charlie      M   35      26-35       57.142857
3    David      M   40      36-45       57.142857
4      Eve      F   22      19-25       42.857143
5      Fay      F   28      26-35       42.857143
6   George      M   34      26-35       57.142857

In [46]:
df.pivot_table(index=['name','gender','age_groups','gender_percent'],aggfunc='size',fill_value=0,observed=True).reset_index(name='count')

      name gender age_groups  gender_percent  count
0    Alice      F      19-25       42.857143      1
1      Bob      M      26-35       57.142857      1
2  Charlie      M      26-35       57.142857      1
3    David      M      36-45       57.142857      1
4      Eve      F      19-25       42.857143      1
5      Fay      F      26-35       42.857143      1
6   George      M      26-35       57.142857      1

In [50]:
df.pivot_table(index=['gender','gender_percent'],columns=['age_groups'],aggfunc='size',fill_value=0,observed=True)

age_groups             19-25  26-35  36-45
gender gender_percent
F      42.857143           2      1      0
M      57.142857           0      3      1

## pandas.melt()

pandas.melt() unpivots a DataFrame from wide fromat to long format

In [51]:
df=pd.DataFrame({'Name':['John','Deepak','Kavya'],
    'Course':['Masters','Graduate','Graduate'],
    'Age':[27,23,21]
})

In [52]:
df.head()

     Name    Course  Age
0    John   Masters   27
1  Deepak  Graduate   23
2   Kavya  Graduate   21

In [53]:
#multiple unpivot
pd.melt(df,id_vars='Name',value_vars=['Course','Age'])

     Name variable     value
0    John   Course   Masters
1  Deepak   Course  Graduate
2   Kavya   Course  Graduate
3    John      Age        27
4  Deepak      Age        23
5   Kavya      Age        21

## pandas.pivot

In [56]:
pd.pivot(df,index='Name',columns='Course',values='Age')

Course  Graduate  Masters
Name
Deepak      23.0      NaN
John         NaN     27.0
Kavya       21.0      NaN

## pandas.crosstab
This method is used to compute a simple cross-tabulation of two or more factors

In [124]:
df=pd.read_csv('Mall_Customers.csv')
df.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [79]:
filtered_df=df[(df['Age']>18) & (df['Age']<30)]

In [81]:

pd.crosstab(filtered_df['Age'],filtered_df['Genre'])

Genre  Female  Male
Age
19          2     6
20          2     3
21          4     1
22          2     1
23          6     0
24          2     2
25          1     2
26          0     2
27          4     2
28          1     3
29          4     1

In [82]:
df.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

## pandas.cut()
used to seperate teh array element inot diff bin

In [84]:
df['bins']=pd.cut(df['Spending Score (1-100)'],bins=[10,20,30,40,50,60,70,80,90,100])

In [88]:
df.head()

,CustomerID,Genre,Age,Annual Income (k$),Spending Score (1-100),bins
0,1,Male,19,15,39,"(30.0, 40.0]"
1,2,Male,21,15,81,"(80.0, 90.0]"
2,3,Female,20,16,6,NaN
3,4,Female,23,16,77,"(70.0, 80.0]"
4,5,Female,31,17,40,"(30.0, 40.0]"

### pandas.merge()

-- Merge two pandas dataframe on certain column using merge function

In [89]:
# First DataFrame
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

# Second DataFrame
df2 = pd.DataFrame({
    'ID': [1, 2, 4],
    'Age': [25, 30, 22]
})

# Third DataFrame
df3 = pd.DataFrame({
    'ID': [1, 3, 5],
    'City': ['New York', 'Los Angeles', 'Chicago']
})

In [90]:
df1_df2=pd.merge(df1,df2,on='ID',how='outer')
df1_df2

   ID     Name   Age
0   1    Alice  25.0
1   2      Bob  30.0
2   3  Charlie   NaN
3   4      NaN  22.0

In [91]:
final_df=pd.merge(df1_df2,df3,on='ID',how='outer')
final_df

   ID     Name   Age         City
0   1    Alice  25.0     New York
1   2      Bob  30.0          NaN
2   3  Charlie   NaN  Los Angeles
3   4      NaN  22.0          NaN
4   5      NaN   NaN      Chicago

## pandas.merge_ordered()
-- This method used to designed for ordered data like time series data

In [92]:
# First DataFrame
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Date': ['2021-01-01', '2021-02-01', '2021-03-01']
})

# Second DataFrame
df2 = pd.DataFrame({
    'ID': [1, 2, 4],
    'Age': [25, 30, 22],
    'Date': ['2021-01-01', '2021-02-01', '2021-04-01']
})

# Third DataFrame
df3 = pd.DataFrame({
    'ID': [1, 3, 5],
    'City': ['New York', 'Los Angeles', 'Chicago'],
    'Date': ['2021-01-01', '2021-03-01', '2021-05-01']
})

In [100]:
df1_df2=pd.merge_ordered(df1,df2,on=['ID','Date'],how='outer',suffixes = ('_df1', '_df2'))

In [102]:
final_df = pd.merge_ordered(df1_df2, df3, on=['ID', 'Date'], how='outer', suffixes=('', '_df3'))
final_df

   ID     Name        Date   Age         City
0   1    Alice  2021-01-01  25.0     New York
1   2      Bob  2021-02-01  30.0          NaN
2   3  Charlie  2021-03-01   NaN  Los Angeles
3   4      NaN  2021-04-01  22.0          NaN
4   5      NaN  2021-05-01   NaN      Chicago

## pd.concat
concatenate two dataframe

In [103]:
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

# Second DataFrame
df2 = pd.DataFrame({
    'ID': [4, 5, 6],
    'Name': ['David', 'Eve', 'Frank']
})

# Third DataFrame
df3 = pd.DataFrame({
    'ID': [7, 8, 9],
    'Name': ['Grace', 'Heidi', 'Ivan']
})

In [116]:
df_concat=pd.concat([df1,df2,df3],axis=0,keys=['key1', 'key2', 'key3'])
df_concat

        ID     Name
key1 0   1    Alice
     1   2      Bob
     2   3  Charlie
key2 0   4    David
     1   5      Eve
     2   6    Frank
key3 0   7    Grace
     1   8    Heidi
     2   9     Ivan

In [120]:
df.head()

,CustomerID,Genre,Age,Annual Income (k$),Spending Score (1-100),bins
0,1,Male,19,15,39,"(30.0, 40.0]"
1,2,Male,21,15,81,"(80.0, 90.0]"
2,3,Female,20,16,6,NaN
3,4,Female,23,16,77,"(70.0, 80.0]"
4,5,Female,31,17,40,"(30.0, 40.0]"

In [128]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Age                     200 non-null    int64
 2   Annual Income (k$)      200 non-null    int64
 3   Spending Score (1-100)  200 non-null    int64
 4   Genre_Male              200 non-null    bool
dtypes: bool(1), int64(4)
memory usage: 6.6 KB

In [126]:
df = pd.get_dummies(df, drop_first=True, columns=['Genre'])

In [134]:
df['Genre'] = df['Genre_Male'].map({True: 'Male', False: 'Female'})

In [135]:
df

,CustomerID,Age,Annual Income (k$),Spending Score (1-100),Genre_Male,Genre
0,1,19,15,39,True,Male
1,2,21,15,81,True,Male
2,3,20,16,6,False,Female
3,4,23,16,77,False,Female
4,5,31,17,40,False,Female
...,...,...,...,...,...,...
195,196,35,120,79,False,Female
196,197,45,126,28,False,Female
197,198,32,126,74,True,Male
198,199,32,137,18,True,Male
199,200,30,137,83,True,Male

## pd.factorize()

-- Method helps to get numeric representation of an array by identifying distinct values

In [140]:
df = pd.DataFrame({
    'Color': ['Red', 'Green', 'Blue', 'Red', 'Green', 'Blue'],
    'Size': ['S', 'M', 'L', 'M', 'L', 'S'],
    'Shape': ['Circle', 'Square', 'Triangle', 'Circle', 'Triangle', 'Square']
})

In [138]:
df[['Color','Size','Shape']]=df[['Color','Size','Shape']].apply(lambda x:pd.factorize(x)[0])

In [139]:
df

   Color  Size  Shape
0      0     0      0
1      1     1      1
2      2     2      2
3      0     1      0
4      1     2      2
5      2     0      1

In [144]:
pd.factorize(df['Color'])[0]

array([0, 1, 2, 0, 1, 2], dtype=int64)

## pandas.unique

In [148]:
import pandas as pd

# Example DataFrame
df = pd.DataFrame({
    'Color': ['Red', 'Green', 'Blue', 'Red', 'Green', 'Blue'],
    'Size': ['S', 'M', 'L', 'M', 'L', 'S'],
    'Shape': ['Circle', 'Square', 'Triangle', 'Circle', 'Triangle', 'Square']
})

print("Original DataFrame:")
df

Original DataFrame:

   Color Size     Shape
0    Red    S    Circle
1  Green    M    Square
2   Blue    L  Triangle
3    Red    M    Circle
4  Green    L  Triangle
5   Blue    S    Square

In [149]:
df_unique_col={col:pd.unique(df[col]) for col in df.columns}

In [150]:
df_unique_col

{'Color': array(['Red', 'Green', 'Blue'], dtype=object),
 'Size': array(['S', 'M', 'L'], dtype=object),
 'Shape': array(['Circle', 'Square', 'Triangle'], dtype=object)}

In [155]:
for key,values in df_unique_col.items():
    print(f"The column '{key}' has values {values}")

The column 'Color' has values ['Red' 'Green' 'Blue']
The column 'Size' has values ['S' 'M' 'L']
The column 'Shape' has values ['Circle' 'Square' 'Triangle']

## pd.wide_to_long

-- This method converts wide dataframe to long format dataframe

In [156]:
import pandas as pd

# Example DataFrame in wide format
df_wide = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Sales_2020': [200, 150, 300],
    'Sales_2021': [220, 180, 330],
    'Sales_2022': [250, 200, 360]
})

In [165]:
df_wide

   ID     Name  Sales_2020  Sales_2021  Sales_2022
0   1    Alice         200         220         250
1   2      Bob         150         180         200
2   3  Charlie         300         330         360

In [159]:
df_wide2 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Sales_Jan': [200, 150, 300],
    'Sales_Feb': [220, 180, 330],
    'Sales_Mar': [250, 200, 360]
})

In [161]:
df_long = pd.wide_to_long(df_wide, 
                          stubnames='Sales', 
                          i='ID', 
                          j='Year', 
                          sep='_', 
                          suffix='.+')

In [162]:
df_long2 = pd.wide_to_long(df_wide2, 
                          stubnames='Sales', 
                          i='ID', 
                          j='Month', 
                          sep='_', 
                          suffix='.+')

In [164]:
df_long

            Name  Sales
ID Year
1  2020    Alice    200
2  2020      Bob    150
3  2020  Charlie    300
1  2021    Alice    220
2  2021      Bob    180
3  2021  Charlie    330
1  2022    Alice    250
2  2022      Bob    200
3  2022  Charlie    360

In [163]:
df_long2

             Name  Sales
ID Month
1  Jan      Alice    200
2  Jan        Bob    150
3  Jan    Charlie    300
1  Feb      Alice    220
2  Feb        Bob    180
3  Feb    Charlie    330
1  Mar      Alice    250
2  Mar        Bob    200
3  Mar    Charlie    360

In [166]:
df = pd.DataFrame({
    'Student': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 90, 78],
    'Science': [92, 88, 80],
    'English': [88, 85, 82]
})

In [168]:
## pd.eval used for calculating row wise values
df['total']=pd.eval(df.Math+df.Science+df.English, engine='numexpr', parser='pandas', target=df)
df

   Student  Math  Science  English total
0    Alice    85       92       88   265
1      Bob    90       88       85   263
2  Charlie    78       80       82   240

In [175]:
df['Percentage']=pd.eval((df.total/300)*100,engine='numexpr', parser='pandas', target=df)

In [3]:
import pandas as pd

In [4]:
df=pd.read_csv('Mall_customers.csv')

In [180]:
df.index# to chekc the index

RangeIndex(start=0, stop=200, step=1)

In [181]:
df.columns # to check the columns

Index(['CustomerID', 'Genre', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [182]:
df.dtypes

CustomerID                 int64
Genre                     object
Age                        int64
Annual Income (k$)         int64
Spending Score (1-100)     int64
dtype: object

In [183]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [6]:
##df.select_dtypes()

df.select_dtypes(include='int64').head()

   CustomerID  Age  Annual Income (k$)  Spending Score (1-100)
0           1   19                  15                      39
1           2   21                  15                      81
2           3   20                  16                       6
3           4   23                  16                      77
4           5   31                  17                      40

In [7]:
df.select_dtypes(include='object')

      Genre
0      Male
1      Male
2    Female
3    Female
4    Female
..      ...
195  Female
196  Female
197    Male
198    Male
199    Male

[200 rows x 1 columns]

In [9]:
#return a numpy representation of the dataframe
df['Annual Income (k$)'].values

array([ 15,  15,  16,  16,  17,  17,  18,  18,  19,  19,  19,  19,  20,
        20,  20,  20,  21,  21,  23,  23,  24,  24,  25,  25,  28,  28,
        28,  28,  29,  29,  30,  30,  33,  33,  33,  33,  34,  34,  37,
        37,  38,  38,  39,  39,  39,  39,  40,  40,  40,  40,  42,  42,
        43,  43,  43,  43,  44,  44,  46,  46,  46,  46,  47,  47,  48,
        48,  48,  48,  48,  48,  49,  49,  50,  50,  54,  54,  54,  54,
        54,  54,  54,  54,  54,  54,  54,  54,  57,  57,  58,  58,  59,
        59,  60,  60,  60,  60,  60,  60,  61,  61,  62,  62,  62,  62,
        62,  62,  63,  63,  63,  63,  63,  63,  64,  64,  65,  65,  65,
        65,  67,  67,  67,  67,  69,  69,  70,  70,  71,  71,  71,  71,
        71,  71,  72,  72,  73,  73,  73,  73,  74,  74,  75,  75,  76,
        76,  77,  77,  77,  77,  78,  78,  78,  78,  78,  78,  78,  78,
        78,  78,  78,  78,  79,  79,  81,  81,  85,  85,  86,  86,  87,
        87,  87,  87,  87,  87,  88,  88,  88,  88,  93,  93,  97,  97,
        98,  98,  99,  99, 101, 101, 103, 103, 103, 103, 113, 113, 120,
       120, 126, 126, 137, 137], dtype=int64)

In [65]:
#return a list representing axes of teh dataframe
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['Name', 'Age', 'Salary'], dtype='object')]

In [15]:
# to check the n dim
df.ndim

2

In [16]:
df.shape# to return a tuple representing dimensionality of dataframe

(200, 5)

In [17]:
df.size# to check the number of element in dataframe

1000

In [18]:
df.memory_usage()# to check memory usage of each column

Index                      132
CustomerID                1600
Genre                     1600
Age                       1600
Annual Income (k$)        1600
Spending Score (1-100)    1600
dtype: int64

In [21]:
df['Age']=df['Age'].astype('int32')

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     200 non-null    int32
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int32(1), int64(3), object(1)
memory usage: 7.2+ KB

In [24]:
df.empty

False

In [25]:
#Make a copy of dataframe
df_copy=df.copy()
df_copy

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

df_copy=df -- Changes in one dataframe it will reflect in other dataframe as well for avoiding we need to use .copy()

In [26]:
#return how many rows
df.head(2)

   CustomerID Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1  Male   19                  15                      39
1           2  Male   21                  15                      81

In [27]:
df.tail(3)

     CustomerID Genre  Age  Annual Income (k$)  Spending Score (1-100)
197         198  Male   32                 126                      74
198         199  Male   32                 137                      18
199         200  Male   30                 137                      83

In [29]:
## Access a single value for row/column label pair
df.at[197,'Age']##cell no,column name

32

In [31]:
df.loc[197,'Age']

32

In [38]:
filtered_df = df.loc[(df['Annual Income (k$)'] > 100) & (df['Age'] < 35)]

In [51]:
df.iloc[:30]# retuning the sing row

    CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0            1    Male   19                  15                      39
1            2    Male   21                  15                      81
2            3  Female   20                  16                       6
3            4  Female   23                  16                      77
4            5  Female   31                  17                      40
5            6  Female   22                  17                      76
6            7  Female   35                  18                       6
7            8  Female   23                  18                      94
8            9    Male   64                  19                       3
9           10  Female   30                  19                      72
10          11    Male   67                  19                      14
11          12  Female   35                  19                      99
12          13  Female   58                  20                      15
13          14  Female   24                  20                      77
14          15    Male   37                  20                      13
15          16    Male   22                  20                      79
16          17  Female   35                  21                      35
17          18    Male   20                  21                      66
18          19    Male   52                  23                      29
19          20  Female   35                  23                      98
20          21    Male   35                  24                      35
21          22    Male   25                  24                      73
22          23  Female   46                  25                       5
23          24    Male   31                  25                      73
24          25  Female   54                  28                      14
25          26    Male   29                  28                      82
26          27  Female   45                  28                      32
27          28    Male   35                  28                      61
28          29  Female   40                  29                      31
29          30  Female   23                  29                      87

In [32]:
df.iloc[197,2]

32

In [30]:
#basaed on integer position
df.iat[197,2]

32

In [58]:
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 22]}
df = pd.DataFrame(data)

In [69]:
df.insert(loc=2, column='Salary', value=[50000,30000,20000])

In [60]:
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   30000
2  Charlie   22   20000

## df.items()

-- Iterates over DataFrame columns, returning a tuple with column name and content as a series

In [61]:
for label,values in df.items():
    print(f'Label is {label} and values is \n{values}')
    print()

Label is Name and values is
0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

Label is Age and values is
0    25
1    30
2    22
Name: Age, dtype: int64

Label is Salary and values is
0    50000
1    30000
2    20000
Name: Salary, dtype: int64

In [62]:
df.columns# both are retrieve the column name

Index(['Name', 'Age', 'Salary'], dtype='object')

In [63]:
df.keys()

Index(['Name', 'Age', 'Salary'], dtype='object')

In [64]:
# Iterate over rows using itertuples()
for row in df.itertuples():
    print(row)

Pandas(Index=0, Name='Alice', Age=25, Salary=50000)
Pandas(Index=1, Name='Bob', Age=30, Salary=30000)
Pandas(Index=2, Name='Charlie', Age=22, Salary=20000)

In [70]:
a=df.pop('Salary')

In [71]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22

In [72]:
df=df.join(a)

In [73]:
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   30000
2  Charlie   22   20000

In [74]:
df.get(['Name','Age'])

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22

In [75]:
df['Age'].isin([20,25])

0     True
1    False
2    False
Name: Age, dtype: bool

In [84]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [23, 45, 25, 35],
    'Income': [50000, 60000, 45000, 70000]
}
df_sa = pd.DataFrame(data)
import numpy as np

df_sa['AgeGroup'] = np.where(df_sa['Age'] < 30, 'Young', 'Old')

In [85]:
df_sa['Income']=np.where(df_sa['Age']<30,df_sa['Income']+5000,df_sa['Income'])

In [86]:
df_sa

      Name  Age  Income AgeGroup
0    Alice   23   55000    Young
1      Bob   45   60000      Old
2  Charlie   25   50000    Young
3    David   35   70000      Old

In [81]:
df=pd.read_csv('Mall_customers.csv')

In [82]:
df.head(2)

   CustomerID Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1  Male   19                  15                      39
1           2  Male   21                  15                      81

In [83]:
df.loc[(df['Age']>30) & (df['Genre']=='Male')]

     CustomerID Genre  Age  Annual Income (k$)  Spending Score (1-100)
8             9  Male   64                  19                       3
10           11  Male   67                  19                      14
14           15  Male   37                  20                      13
18           19  Male   52                  23                      29
20           21  Male   35                  24                      35
23           24  Male   31                  25                      73
27           28  Male   35                  28                      61
30           31  Male   60                  30                       4
32           33  Male   53                  33                       4
42           43  Male   48                  39                      36
51           52  Male   33                  42                      60
53           54  Male   59                  43                      60
55           56  Male   47                  43                      41
57           58  Male   69                  44                      46
59           60  Male   53                  46                      46
60           61  Male   70                  46                      56
64           65  Male   63                  48                      51
70           71  Male   70                  49                      55
74           75  Male   59                  54                      47
77           78  Male   40                  54                      48
80           81  Male   57                  54                      51
81           82  Male   38                  54                      55
82           83  Male   67                  54                      41
85           86  Male   48                  54                      46
92           93  Male   48                  60                      49
98           99  Male   48                  61                      42
102         103  Male   67                  62                      59
104         105  Male   49                  62                      56
107         108  Male   54                  63                      46
108         109  Male   68                  63                      43
109         110  Male   66                  63                      48
110         111  Male   65                  63                      52
123         124  Male   39                  69                      91
126         127  Male   43                  71                      35
127         128  Male   40                  71                      95
128         129  Male   59                  71                      11
129         130  Male   38                  71                      75
130         131  Male   47                  71                       9
131         132  Male   39                  71                      75
137         138  Male   32                  73                      73
141         142  Male   32                  75                      93
146         147  Male   48                  77                      36
149         150  Male   34                  78                      90
150         151  Male   43                  78                      17
151         152  Male   39                  78                      88
156         157  Male   37                  78                       1
158         159  Male   34                  78                       1
164         165  Male   50                  85                      26
166         167  Male   42                  86                      20
169         170  Male   32                  87                      63
170         171  Male   40                  87                      13
172         173  Male   36                  87                      10
173         174  Male   36                  87                      92
176         177  Male   58                  88                      15
178         179  Male   59                  93                      14
179         180  Male   35                  93                      90
182         183  Male   46                  98                      15
192         193  Male   33                 113                       8
197         198  Male   32                 126                      74
198         199  Male   32                 137                      18

In [93]:
df_sa

      Name  Age  Income AgeGroup
0    Alice   23   55000    Young
1      Bob   45   60000      Old
2  Charlie   25   50000    Young
3    David   35   70000      Old

In [96]:
# Using query to filter rows where Age > 25 and Income < 70000
result = df_sa.query('Age > 25 and Income < 70000')

print(result)

  Name  Age  Income AgeGroup
1  Bob   45   60000      Old

In [97]:
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]
})

series = pd.Series([10, 20], index=['A', 'B'])

In [99]:
df.add(series)

    A   B
0  11  24
1  12  25
2  13  26

In [100]:
df.sub(series)# df-sereis

   A   B
0 -9 -16
1 -8 -15
2 -7 -14

In [104]:
df.rsub(series)## series-df

   A   B
0  9  16
1  8  15
2  7  14

In [101]:
df.dot(series)

0     90
1    120
2    150
dtype: int64

In [102]:
df.add(10)

    A   B
0  11  14
1  12  15
2  13  16

In [103]:
df.radd(10)

    A   B
0  11  14
1  12  15
2  13  16

In [105]:
import pandas as pd

df = pd.DataFrame({
    'CustomerID': [1, 2, 3, 4, 5],
    'AnnualIncome': [50000, 60000, 70000, 80000, 90000]
})

low_income_customers = df[df['AnnualIncome'].lt(70000)]

print(low_income_customers)

   CustomerID  AnnualIncome
0           1         50000
1           2         60000

In [106]:
## Array to Dataframe

In [111]:
import numpy as np
import pandas as pd
marks=np.array([[33,24,33,25],[45,78,92,14]])
df=pd.DataFrame(marks,columns=['subject1','subject2','subject3','subject4'],index=['Arun','Divya'])
df

       subject1  subject2  subject3  subject4
Arun         33        24        33        25
Divya        45        78        92        14

In [113]:
Student_details=np.array([['John',34,1995,2017],['Arun',32,1996,2018]],dtype='object')
df=pd.DataFrame(Student_details,columns=['Name','Age','DOB','GY'])
df

   Name Age   DOB    GY
0  John  34  1995  2017
1  Arun  32  1996  2018

In [117]:
df['Age']=df['Age'].astype(int)
df['DOB']=df['Age'].astype(int)
df['GY']=df['Age'].astype(int)

In [119]:
from datetime import datetime

current_year = datetime.now().year
current_year

2024

In [122]:
df['D_O_B'] = pd.to_datetime(current_year - df['Age'], format='%Y')

In [123]:
df

   Name  Age  DOB  GY      D_O_B
0  John   34   34  34 1990-01-01
1  Arun   32   32  32 1992-01-01

In [125]:
array_1d = np.array([1, 2, 3, 4, 5])
list_1d=array_1d.tolist()

In [126]:
list_1d

[1, 2, 3, 4, 5]

In [128]:
#convert list of tuple to dict
marks=[('Abi',55),('Anand',45)]
mark_dict=dict(marks)

In [129]:
mark_dict

{'Abi': 55, 'Anand': 45}

In [140]:
index=[1,2,3]
courses=['Python','ML','data science']
learning_hr=['2','4','6']
# two seperate list convert to dict using zip
course_dict=list(zip(index,courses))
learn_dict=dict(zip(course_dict,learning_hr))

In [141]:
learn_dict

{(1, 'Python'): '2', (2, 'ML'): '4', (3, 'data science'): '6'}

In [144]:
dict(zip(index,[{'courses':course,'hr':hr} for course,hr in zip(courses,learning_hr)]))

{1: {'courses': 'Python', 'hr': '2'},
 2: {'courses': 'ML', 'hr': '4'},
 3: {'courses': 'data science', 'hr': '6'}}

In [145]:
lst=[1,3,6,9]
[{'Number':lst,'Sq_of_number':lst*lst} for lst in lst]

[{'Number': 1, 'Sq_of_number': 1},
 {'Number': 3, 'Sq_of_number': 9},
 {'Number': 6, 'Sq_of_number': 36},
 {'Number': 9, 'Sq_of_number': 81}]

In [149]:
[{i: i * 2 for i in lst}]

[{1: 2, 3: 6, 6: 12, 9: 18}]

In [1]:
#Lambda using assign

In [2]:
import pandas as pd
data=[[78,98,60],[78,89,67],[89,96,75]]
df=pd.DataFrame(data,columns=['Sub1','Sub2','Sub3'])
df

   Sub1  Sub2  Sub3
0    78    98    60
1    78    89    67
2    89    96    75

In [3]:
#create new columns as total by adding all the columns
df=df.assign(Subject=lambda x:x['Sub1']+x['Sub2']+x['Sub3'])

In [20]:
df

   Sub1  Sub2  Sub3  Subject
0    78    98    80      236
1    78    89    87      234
2    89    96    95      260

In [22]:
df['Sub1_status']=df['Sub1'].apply(lambda x:'Good' if x>80 else 'Average')

In [23]:
df['Sub2_adjusted']=df['Sub2'].apply(lambda x:x+1 if x>90 else x-1)

In [26]:
df['overall_status'] = df.apply(lambda x: 'excellent' if ((x['Sub1'] + x['Sub2'] + x['Sub3']) / 3) >= 70 
                                else ('Good' if ((x['Sub1'] + x['Sub2'] + x['Sub3']) / 3) > 60 
                                      else 'Need improvement'), axis=1)

In [27]:
df

   Sub1  Sub2  Sub3  Subject Sub1_status  Sub2_adjusted overall_status
0    78    98    80      236     Average             99      excellent
1    78    89    87      234     Average             88      excellent
2    89    96    95      260        Good             97      excellent

In [30]:
my_dict={'A':20,'B':45}
my_list=list(my_dict.items())

In [33]:
my_dict_1=dict(my_list)

In [34]:
my_dict_1

{'A': 20, 'B': 45}

In [ ]:
my_dict={'A':20,'B':45}
#using zip method
[for key,values in zip(my_dict.items()]

In [21]:
name = ['Alice', 'John', 'Arun', 'Divya']
age = [29, 30, 29, 21]
department = ['HR', 'Engineering', 'Marketing', 'Finance']

zipped=zip(name,age,department)

In [25]:
filterd=filter(lambda x:x[1]<29,zipped)

In [27]:
mapped=map(lambda x:f'Name: {x[0]} Age: {x[1]} department: {x[2]}',filterd)

In [28]:
list(mapped)

['Name: Divya Age: 21 department: Finance']

In [30]:
inputs={'Hello':45,'HopeAI':20,'Python':30}
list(map(list,inputs.items()))

[['Hello', 45], ['HopeAI', 20], ['Python', 30]]

In [40]:
str(ord('A'))

'65'